; domain
(define (domain blocksworld)
  (:requirements :strips :typing)
  (:types block)
  (:predicates (on ?x - block ?y - block)
         (ontable ?x - block)
         (clear ?x - block)
         (handempty)
         (holding ?x - block)
         )

  (:action pick_up
       :parameters (?x - block)
       :precondition (and (clear ?x) (ontable ?x) (handempty))
       :effect
       (and (not (ontable ?x))
       (not (clear ?x))
       (not (handempty))
       (holding ?x)))

  (:action put_down
       :parameters (?x - block)
       :precondition (holding ?x)
       :effect
       (and (not (holding ?x))
       (clear ?x)
       (handempty)
       (ontable ?x)))

  (:action stack
       :parameters (?x - block ?y - block)
       :precondition (and (holding ?x) (clear ?y))
       :effect
       (and (not (holding ?x))
       (not (clear ?y))
       (clear ?x)
       (handempty)
       (on ?x ?y)))
  (:action unstack
       :parameters (?x - block ?y - block)
       :precondition (and (on ?x ?y) (clear ?x) (handempty))
       :effect
       (and (holding ?x)
       (clear ?y)
       (not (clear ?x))
       (not (handempty))
       (not (on ?x ?y))))

)

; problem
(define (problem bw_rand_3)
(:domain blocksworld)
(:objects b1 b2 b3 - block)
(:init
(handempty)
(ontable b1)
(on b2 b1)
(ontable b3)
(clear b2)
(clear b3)
)
(:goal
(and
(on b3 b1))
)
)

; plan
1. (unstack b2 b1)
   deleted: (clear b2) (handempty) (on b2 b1)
   added: (holding b2) (clear b1)
   goals met: 0 of 1
2. (put_down b2)
   deleted: (holding b2)
   added: (clear b2) (handempty) (ontable b2)
   goals met: 0 of 1
3. (pick_up b3)
   deleted: (ontable b3) (clear b3) (handempty)
   added: (holding b3)
   goals met: 0 of 1
4. (stack b3 b1)
   deleted: (holding b3) (clear b1)
   added: (clear b3) (handempty) (on b3 b1)
   goals met: 1 of 1
